non-nix/doom/config.org
#+title: Config



* UI

** Doom

Doom exposes five (optional) variables for controlling fonts in Doom:

`doom-font' -- the primary font to use
`doom-variable-pitch-font' -- a non-monospace font (where applicable)
`doom-big-font' -- used for `doom-big-font-mode'; use this for presentations or streaming.
`doom-symbol-font' -- for symbols
`doom-serif-font' -- for the `fixed-pitch-serif' face

#+begin_src elisp
(setq doom-font (font-spec :family "Jetbrains Mono NerdFont" :size 30))
#+end_src


There are two ways to load a theme. Both assume the theme is installed and
available. You can either set `doom-theme' or manually load a theme with the
`load-theme' function. This is the default:
#+begin_src elisp
(setq doom-theme 'doom-gruvbox-light)
#+end_src

#+begin_src elisp
(setq display-line-numbers-type 'visual)
#+end_src

* Packages

** Org Moderen

#+begin_src elisp
(add-hook 'org-mode-hook #'org-modern-mode)
#+end_src


** Typst-Ts-Mode

#+begin_src elisp
(require 'typst-ts-mode)
(add-to-list 'auto-mode-alist '("\\.typ\\'" . typst-ts-mode))
(after! typst-ts-mode
  (add-hook 'typst-ts-mode-hook #'lsp)
  (add-hook 'typst-ts-mode-hook #'adaptive-wrap-prefix-mode)
  )

(after! lsp-mode
  (add-to-list 'lsp-language-id-configuration '(typst-ts-mode . "typst"))
  (lsp-register-client (make-lsp-client
                        :new-connection (lsp-stdio-connection "tinymist")
                        :major-modes '(typst-ts-mode)
                        :server-id 'tinymist)))
#+end_src


#+begin_src elisp
(setq org-typst-from-latex-environment #'org-typst-from-latex-with-naive
      org-typst-from-latex-fragment #'org-typst-from-latex-with-naive)
(after! org
  (require 'ox-typst))
#+end_src



** Gleam-Mode


#+begin_src elisp
(use-package! gleam-ts-mode
  :mode (rx ".gleam" eos))

(after! treesit
  (add-to-list 'auto-mode-alist '("\\.gleam$" . gleam-ts-mode)))

(after! gleam-ts-mode
  (unless (treesit-language-available-p 'gleam)
    (gleam-ts-install-grammar)))
#+end_src


** Evil-Snipe
#+begin_src elisp
(setq evil-snipe-scope 'visible)
#+end_src
